Revit 2024 API
PrimarySizeCriterion Methods
The PrimarySizeCriterion type exposes the following members.
Methods
Name | Description
All
 Creates a criterion with a range of all sizes.
Dispose |  (Inherited from RoutingCriterionBase.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Verify if two criteria are the same.
 (Inherited from RoutingCriterionBase.)
None
 Creates a criterion with a range of no sizes.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace